{
  "a": {
    "messages": [
      {
        "text": "Hi Lucy- nice to meet you :) How is your week going so far?",
        "msg_id": 0,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Good morning Nick :) My week is going well. Just started my work week! How has yours been",
        "msg_id": 1,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Very nice :) What kind of work do you do? My week is going swell. Busy busy, but happy with it all. Do you live in the city or the east bay?",
        "msg_id": 2,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I'm a hairstylist in Burlingame and I live in the city! It's a fun job. No two days are the same!",
        "msg_id": 3,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Very cool! Do you have a lot of clients who let you get innovative? :)",
        "msg_id": 4,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I do! I like those people the best who come in and say \"do whatever you want!\" It makes my life so easy",
        "msg_id": 5,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "I do! I like those people the best who come in and say \"do whatever you want!\" It makes my life so easy",
        "msg_id": 6,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Totally :) So have you always lives in the Bay Area?",
        "msg_id": 7,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I have but I moved up north for a little bit in auburn and then I moved to Tennessee for a little bit but I always end up back here",
        "msg_id": 8,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Oh wow. What did you go to Tennessee for?",
        "msg_id": 9,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Lol I needed space so I left",
        "msg_id": 10,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Fair enough! How's your tinder experience been so far?",
        "msg_id": 11,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I've only been on it a couple dates. There definitely are some weirdos but I've talked to a few cool people",
        "msg_id": 12,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Nice! Well, if you want to, Add me on Facebook! Nick Raushenbush",
        "msg_id": 13,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "How love have you been on tinder",
        "msg_id": 14,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Pretty much since the app came out. I'm an early adopter of tech :)",
        "msg_id": 15,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "How about you?",
        "msg_id": 16,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Lol like a day ago or so",
        "msg_id": 17,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Very nice! Well I hope your experience gas been good so far, or at least entertaining :)",
        "msg_id": 18,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Don't feel pressured to add me on FB if you don't want to. Just having a chat on here is perfectly fine. I won't take offense lol",
        "msg_id": 19,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "OMG lol I totally forgot that you asked me earlier. I was in the chair getting a tattoo lol! I never really use fb but I can add you in the morning!",
        "msg_id": 20,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "I'm actually in zombie mode right now! Can we catch tomorrow?",
        "msg_id": 21,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Oh rad! What did you get? I always go into zombie mode after I get tattooed. Cool, talk to you mañana.",
        "msg_id": 22,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I got some stuff done on my bicep that represents one of my favorite bible verses. I saw in one of your pics that you have a chest piece and some arm work. I'm a sucker. What are your tattoos of?",
        "msg_id": 23,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Very cool! Awww thanks. Yes, I actually have more work than is seen in my pics. Most of my tattoos are for my little brother and my mom. Unfortunately they both died. Are you a very religious person then?",
        "msg_id": 24,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "OMG I'm so sorry to hear that. I would say I am but not the kind that shoves it down your throat",
        "msg_id": 25,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Thank you. Well that's good! I think religion is great when people use it for positivity :)",
        "msg_id": 26,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Are you religious at all",
        "msg_id": 27,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "I practice Buddhism. Are you Christian or Catholic?",
        "msg_id": 28,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Christian",
        "msg_id": 29,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Nice :)",
        "msg_id": 30,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "How long have you been practicing Buddhism",
        "msg_id": 31,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "5 years",
        "msg_id": 32,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "So what are your stances on everything? Homosexuality, Sex, Abortion? Right to the fun stuff ;)",
        "msg_id": 33,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Wow lol. I don't think it's my place to judge when it comes to homosexuality or sex. I think above all else whether I agree or not, all that matters is that I love them. I have a lot of gay friends and family and it w",
        "msg_id": 34,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Would break my heart to tell them not to share their lives with someone",
        "msg_id": 35,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "But abortion is very hard for me to accept. I've had friends who have had abortions and I love them the same but I don't think abortion is fair. I think the only way I could maybe justify abortion is if having the baby means the mother would die but women are risking their lives all the time when they're pregnant. I think that most people are well aware of the possible consequences of having sex no matter how safe you and since you know then I don't think an unborn child should have to suffer because you \"aren't ready\". I believe that you should take responsibility of your actions",
        "msg_id": 36,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "I agree with you on homosexuality and completely respect your view on abortion",
        "msg_id": 37,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "My opinion differs, but that's ok",
        "msg_id": 38,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "And maybe rape could justify abortion but someone could adopt that baby. And some people will pay your medical bills to adopt your child so.... I dunno",
        "msg_id": 39,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Thank you for your considerate responses :)",
        "msg_id": 40,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Lol either way my opinion is just that. It's not going to change what a person does but how I treat them makes a difference so I will just continue to love em",
        "msg_id": 41,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Totally",
        "msg_id": 42,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Dinner time ttyl",
        "msg_id": 43,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Sorry I had to run to dinner with a friend. Thank you so much for sharing your views with me. I can tell you've put a lot of thought into them. I can definitely understand where you're coming from. I believe that a woman has the right to choose up until a certain point of development. It's more of a rights thing for me. But I can totally respect your view.",
        "msg_id": 44,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Oh yeah for sure! I wasn't sure if I just scared you off looking like a crazy conservatist or something. I mean I understand why people will do what they do but it just makes me sad lol because I think there are always other options",
        "msg_id": 45,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Not at all. I think your opinion is actually pretty moderate for a Christian who is very religious. In light of the aforementioned, are you remaining abstinent until marriage?",
        "msg_id": 46,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Lol if you're asking if I'm a virgin I'm not. I waited for a long time and gave in. I still take sex very seriously. I don't think I could ever be a casual sex kinda person",
        "msg_id": 47,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "I think a lot of people are like that, religious or not. People can have very different feelings about sex. It can be a pretty deeply personal experience",
        "msg_id": 48,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "What about birth control? What's your position on that?",
        "msg_id": 49,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Btw. I'm not trying to be pervy, I find this to be fascinating. I'm kind of like an anthropologist lol",
        "msg_id": 50,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I think it's good to take precautions but they can only go so far. Birth control isn't a hundred percent but hey why not. At least it's a preventable measure",
        "msg_id": 51,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Lol I definitely don't mind the questions",
        "msg_id": 52,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "That makes sense :)",
        "msg_id": 53,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "So what are you looking for in your love life these days?",
        "msg_id": 54,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Uhmmm that's a big one. Well I would want someone who shares the same values as me and who compliments me and who I compliment back lol. I want growth together and device to each other. I wanna kick it and have fun and laugh and cook lol",
        "msg_id": 55,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "What a wonderful description! It sounds like you're looking for a soul mate :)",
        "msg_id": 56,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Well that's the plan one day.",
        "msg_id": 57,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "What about you",
        "msg_id": 58,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Same for me. I don't think anyone truly knows when they'll meet their soulmate(s), I suppose it just happens naturally.",
        "msg_id": 59,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "That being said, I'm pretty much just dating casually right now. That's how it's been for about a year, and I'm really happy :) Can't say I'm looking for anything or anyone specially, just enjoying meeting new people!",
        "msg_id": 60,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I love meeting new people and making friends. If it happens it happens. If not then not. Ain't no rush!",
        "msg_id": 61,
        "cha_id": 107,
        "wait_sec": 1
      },
      {
        "text": "Nice! :)",
        "msg_id": 62,
        "cha_id": 1,
        "wait_sec": 1
      }
    ],
    "platform": "tinder",
    "branch": {
      "branch_type": "terminal",
      "branch_target": "",
      "terminal_options": {
        "terminal_type": "success",
        "text": ""
      },
      "text": "",
      "options": []
    }
  }
}