{
  "a": {
    "messages": [
      {
        "text": "Hey Colin :) watcha doing in LA?",
        "msg_id": 0,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "I'm visiting and realized that I know nobody on this side of the world!",
        "msg_id": 1,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Haha well just matched with this cute girl. I think she likes me",
        "msg_id": 2,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I moved here not too long ago!",
        "msg_id": 3,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Awwww",
        "msg_id": 4,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Where from? I'm in LA very briefly for work",
        "msg_id": 5,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Startup land. If you're only here for a few hours, let's celebrate",
        "msg_id": 6,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "So from one sunny place to another",
        "msg_id": 7,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Not a few hours but we matched very close to my departure time",
        "msg_id": 8,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Coming back soon though, like this weekend soon",
        "msg_id": 9,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Wow, indeed you travel a lot. How long are you in LA?",
        "msg_id": 10,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Yes lots of travel, very little sleep",
        "msg_id": 11,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Here today, back on Sat for a day",
        "msg_id": 12,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "If you're into photography there is an instameet tmrw night but you're gonna miss it",
        "msg_id": 13,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Aw man that sounds like something interesting.. I'll be in Auckland ): Are these instameets a global thing?",
        "msg_id": 14,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "I don't get in till late on Sat tho, like 8pm touchdown........",
        "msg_id": 15,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Haha wow and you're out Sunday? Such a short trip!",
        "msg_id": 16,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I'm headed to Mexico for fun in a couple weeks, my bff is flying over to visit :)",
        "msg_id": 17,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Yeah, lots of major cities host them. My friend is like insta-famous so she gets comped meals and trips, it's a whole other world",
        "msg_id": 18,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "So is Instagram her full-time job then? I don't know anyone like that! I suppose they're like youtubers",
        "msg_id": 19,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Yeah a day at a time in LA. I've only seen Mexico City of Mexico but I hear the rest of it is beautiful too",
        "msg_id": 20,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "I've been up for 33 hrs, will pass out anytime mow",
        "msg_id": 21,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Are you like a new age homing pigeon that has to deliver messages back / forth?",
        "msg_id": 22,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I'd be exhausted, how are you not on the ground right now passed out with drool leaking down your face",
        "msg_id": 23,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Mmm some of her friends do. Yeah it's like the new age YouTube star, and a bit more spread out",
        "msg_id": 24,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "Hahah! I'm a flight attendant. Some days, I try to convince myself I live a normal life. Days when I've been up 33 hours though....",
        "msg_id": 25,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "My Instagram has always been on private. I should make a public one with all the photos I've collected during this stint",
        "msg_id": 26,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "I don't even think I've don't that many hours in a row at a startup. Please don't fall asleep on one of your passengers",
        "msg_id": 27,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "I'm not that into Tinder chat, do you have whatsapp? Save energy for Saturday",
        "msg_id": 28,
        "cha_id": 1,
        "wait_sec": 1
      },
      {
        "text": "1-555-555-5555",
        "msg_id": 29,
        "cha_id": 113,
        "wait_sec": 1
      },
      {
        "text": "Haha well after a certain point, you forget how tired you are and don't feel it. Hopefully because it's only 2 hours to Cabo from LA so... I shouldn't be sleep deprived Sat",
        "msg_id": 30,
        "cha_id": 113,
        "wait_sec": 1
      }
    ],
    "platform": "tinder",
    "branch": {
      "branch_type": "terminal",
      "branch_target": "",
      "options": []
    }
  }
}